flowchart.dot
digraph "flowchart" {
p0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromPath"];
p2 [label="mmseqs2:CREATE_DB"];
p0 -> p2 [label="fastaFile"];

p1 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromPath"];
p6 [label="msa_hmm:MAFFT"];
p1 -> p6 [label="familyFile"];

p2 [label="mmseqs2:CREATE_DB"];
p3 [label="mmseqs2:LINCLUST"];
p2 -> p3;

p3 [label="mmseqs2:LINCLUST"];
p4 [label="mmseqs2:CREATE_TSV"];
p3 -> p4;

p2 [label="mmseqs2:CREATE_DB"];
p4 [label="mmseqs2:CREATE_TSV"];
p2 -> p4 [label="mmseqsDB"];

p4 [label="mmseqs2:CREATE_TSV"];
p5 [shape=point];
p4 -> p5;

p6 [label="msa_hmm:MAFFT"];
p7 [label="msa_hmm:HMMBUILD"];
p6 -> p7;

p7 [label="msa_hmm:HMMBUILD"];
p8 [shape=point];
p7 -> p8;

}
